#include "Geometory.h"

/**
 * @brief Boxを作成
 *
 */
void Geometory::MakeBox()
{
	//----- 頂点の作成 -----//
	Vertex vtx[] = {
			// -Z
			{{-0.5f, 0.5f, -0.5f}, {0.0f, 0.0f}},	 // 0
			{{0.5f, 0.5f, -0.5f}, {1.0f, 0.0f}},	 // 1
			{{-0.5f, -0.5f, -0.5f}, {0.0f, 1.0f}}, // 2
			{{0.5f, -0.5f, -0.5f}, {1.0f, 1.0f}},	 // 3
			// +Z
			{{0.5f, 0.5f, 0.5f}, {0.0f, 0.0f}},		// 4
			{{-0.5f, 0.5f, 0.5f}, {1.0f, 0.0f}},	// 5
			{{0.5f, -0.5f, 0.5f}, {0.0f, 1.0f}},	// 6
			{{-0.5f, -0.5f, 0.5f}, {1.0f, 1.0f}}, // 7
			// -X
			{{-0.5f, 0.5f, 0.5f}, {0.0f, 0.0f}},	 // 8
			{{-0.5f, 0.5f, -0.5f}, {1.0f, 0.0f}},	 // 9
			{{-0.5f, -0.5f, 0.5f}, {0.0f, 1.0f}},	 // 10
			{{-0.5f, -0.5f, -0.5f}, {1.0f, 1.0f}}, // 11
			// +X
			{{0.5f, 0.5f, -0.5f}, {0.0f, 0.0f}},	// 12
			{{0.5f, 0.5f, 0.5f}, {1.0f, 0.0f}},		// 13
			{{0.5f, -0.5f, -0.5f}, {0.0f, 1.0f}}, // 14
			{{0.5f, -0.5f, 0.5f}, {1.0f, 1.0f}},	// 15
			// -Y
			{{0.5f, -0.5f, 0.5f}, {0.0f, 0.0f}},	 // 16
			{{-0.5f, -0.5f, 0.5f}, {1.0f, 0.0f}},	 // 17
			{{0.5f, -0.5f, -0.5f}, {0.0f, 1.0f}},	 // 18
			{{-0.5f, -0.5f, -0.5f}, {1.0f, 1.0f}}, // 19
			// +Y
			{{-0.5f, 0.5f, 0.5f}, {0.0f, 0.0f}},	// 20
			{{0.5f, 0.5f, 0.5f}, {1.0f, 0.0f}},		// 21
			{{-0.5f, 0.5f, -0.5f}, {0.0f, 1.0f}}, // 22
			{{0.5f, 0.5f, -0.5f}, {1.0f, 1.0f}},	// 23
	};
	//----- インデックスの作成 -----//
	int idx[] = {
			// -Z
			0,
			1,
			2,
			1,
			3,
			2,
			// +Z
			4,
			5,
			6,
			5,
			7,
			6,
			// -X
			8,
			9,
			10,
			9,
			11,
			10,
			// +X
			12,
			13,
			14,
			13,
			15,
			14,
			// -Y
			16,
			17,
			18,
			17,
			19,
			18,
			// +Y
			20,
			21,
			22,
			21,
			23,
			22,
	};
	//----- バッファの作成 -----//
	MeshBuffer::Description desc = {};
	desc.pVtx = vtx;
	desc.vtxCount = 4 * 6;
	desc.vtxSize = sizeof(Vertex);
	desc.pIdx = idx;
	desc.idxCount = 6 * 6;
	desc.idxSize = sizeof(int);
	desc.topology = D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST;
	m_pBox = new MeshBuffer();
	m_pBox->Create(desc);
}

/**
 * @brief Cylinderの作成
 *
 */
void Geometory::MakeCylinder()
{
	//----- 頂点の作成 -----//
	Vertex vtx[] = {
			// 天面、底面
			{{0.f, 0.f, 0.f}, {0.f, 0.f}},
			// 側面

	};
	//----- インデックスの作成 -----//
	// 天面、底面

	// 側面

	//----- バッファの作成 -----//
}

/**
 * @brief Sphereの作成
 *
 */
void Geometory::MakeSphere()
{
	//----- 頂点の作成 -----//

	//----- インデックスの作成 -----//

	//----- バッファの作成 -----//
}